<a href="https://colab.research.google.com/github/JosefinaArayaTapia/CursoPandas/blob/main/meteoritos.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np
pd.__version__

'1.1.5'

In [3]:
from google.colab import drive

drive.mount("/content/drive")

Mounted at /content/drive

In [4]:
dir_pandas = '/content/drive/My Drive/Colab Notebooks/db/{}'
dir_pandas

'/content/drive/My Drive/Colab Notebooks/db/{}'

In [51]:
df_meteroritos=pd.read_csv(dir_pandas.format('meteorite-landings.csv'),parse_dates=['year'])
df_meteroritos

             name     id nametype  ... reclat  reclong               GeoLocation
0          Aachen      1    Valid  ...   50.8      6.1     (50.775000, 6.083330)
1          Aarhus      2    Valid  ...   56.2     10.2    (56.183330, 10.233330)
2            Abee      6    Valid  ...   54.2   -113.0  (54.216670, -113.000000)
3        Acapulco     10    Valid  ...   16.9    -99.9   (16.883330, -99.900000)
4         Achiras    370    Valid  ...  -33.2    -65.0  (-33.166670, -64.950000)
...           ...    ...      ...  ...    ...      ...                       ...
45711  Zillah 002  31356    Valid  ...   29.0     17.0    (29.037000, 17.018500)
45712      Zinder  30409    Valid  ...   13.8      9.0     (13.783330, 8.966670)
45713        Zlin  30410    Valid  ...   49.2     17.7    (49.250000, 17.666670)
45714   Zubkovsky  31357    Valid  ...   49.8     41.5    (49.789170, 41.504600)
45715  Zulu Queen  30414    Valid  ...   34.0   -115.7  (33.983330, -115.683330)

[45716 rows x 10 columns]

In [6]:
df_meteroritos.head(5)

       name   id nametype  ...    reclat    reclong               GeoLocation
0    Aachen    1    Valid  ...  50.77500    6.08333     (50.775000, 6.083330)
1    Aarhus    2    Valid  ...  56.18333   10.23333    (56.183330, 10.233330)
2      Abee    6    Valid  ...  54.21667 -113.00000  (54.216670, -113.000000)
3  Acapulco   10    Valid  ...  16.88333  -99.90000   (16.883330, -99.900000)
4   Achiras  370    Valid  ... -33.16667  -64.95000  (-33.166670, -64.950000)

[5 rows x 10 columns]

In [7]:
df_meteroritos.tail(3)

             name     id  ...    reclong               GeoLocation
45713        Zlin  30410  ...   17.66667    (49.250000, 17.666670)
45714   Zubkovsky  31357  ...   41.50460    (49.789170, 41.504600)
45715  Zulu Queen  30414  ... -115.68333  (33.983330, -115.683330)

[3 rows x 10 columns]

In [8]:
df_meteroritos.sample(5)

                              name     id  ...    reclong               GeoLocation
26738        Northwest Africa 1522  17295  ...        NaN                       NaN
7372                   Dhofar 1571  53885  ...   54.16667    (18.453330, 54.166670)
45460                Yamato 983842  40463  ...    0.00000      (0.000000, 0.000000)
44267                Yamato 981809  38431  ...    0.00000      (0.000000, 0.000000)
32350  Queen Alexandra Range 93106  19195  ...  162.56253  (-84.575780, 162.562530)

[5 rows x 10 columns]

In [10]:
#Filas,Columnas

df_meteroritos.shape

(45716, 10)

In [11]:
#Size filas * columnas
df_meteroritos.size

457160

In [25]:
#quitar notacion cientifica e+00
pd.options.display.float_format = '{:.1f}'.format

In [28]:
df_meteroritos.describe(include='all')

                        name      id  ... reclong           GeoLocation
count                  45716 45716.0  ... 38401.0                 38401
unique                 45716     nan  ...     nan                 17100
top     Ramlat as Sahmah 358     nan  ...     nan  (0.000000, 0.000000)
freq                       1     nan  ...     nan                  6214
mean                     NaN 26889.7  ...    61.1                   NaN
std                      NaN 16860.7  ...    80.6                   NaN
min                      NaN     1.0  ...  -165.4                   NaN
25%                      NaN 12688.8  ...     0.0                   NaN
50%                      NaN 24261.5  ...    35.7                   NaN
75%                      NaN 40656.8  ...   157.2                   NaN
max                      NaN 57458.0  ...   354.5                   NaN

[11 rows x 10 columns]

In [30]:
df_meteroritos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass         45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45428 non-null  float64
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(4), int64(1), object(5)
memory usage: 3.5+ MB

In [31]:
df_meteroritos.dtypes

name            object
id               int64
nametype        object
recclass        object
mass           float64
fall            object
year           float64
reclat         float64
reclong        float64
GeoLocation     object
dtype: object

In [33]:
#Convertir Tipos  
df_meteroritos.convert_dtypes().dtypes

name            string
id               Int64
nametype        string
recclass        string
mass           float64
fall            string
year             Int64
reclat         float64
reclong        float64
GeoLocation     string
dtype: object

In [34]:
df_meteroritos.nunique()

name           45716
id             45716
nametype           2
recclass         466
mass           12576
fall               2
year             268
reclat         12738
reclong        14640
GeoLocation    17100
dtype: int64

In [37]:
df_meteroritos[['fall','nametype']]=df_meteroritos[['fall','nametype']].astype('category')
df_meteroritos

             name     id nametype  ... reclat  reclong               GeoLocation
0          Aachen      1    Valid  ...   50.8      6.1     (50.775000, 6.083330)
1          Aarhus      2    Valid  ...   56.2     10.2    (56.183330, 10.233330)
2            Abee      6    Valid  ...   54.2   -113.0  (54.216670, -113.000000)
3        Acapulco     10    Valid  ...   16.9    -99.9   (16.883330, -99.900000)
4         Achiras    370    Valid  ...  -33.2    -65.0  (-33.166670, -64.950000)
...           ...    ...      ...  ...    ...      ...                       ...
45711  Zillah 002  31356    Valid  ...   29.0     17.0    (29.037000, 17.018500)
45712      Zinder  30409    Valid  ...   13.8      9.0     (13.783330, 8.966670)
45713        Zlin  30410    Valid  ...   49.2     17.7    (49.250000, 17.666670)
45714   Zubkovsky  31357    Valid  ...   49.8     41.5    (49.789170, 41.504600)
45715  Zulu Queen  30414    Valid  ...   34.0   -115.7  (33.983330, -115.683330)

[45716 rows x 10 columns]

In [38]:
df_meteroritos.dtypes

name             object
id                int64
nametype       category
recclass         object
mass            float64
fall           category
year            float64
reclat          float64
reclong         float64
GeoLocation      object
dtype: object

In [39]:
df_meteroritos['fall'].unique()

['Fell', 'Found']
Categories (2, object): ['Fell', 'Found']

In [40]:
df_meteroritos['nametype'].unique()

['Valid', 'Relict']
Categories (2, object): ['Valid', 'Relict']

In [41]:
df_meteroritos['fall'].value_counts()

Found    44609
Fell      1107
Name: fall, dtype: int64

In [42]:
pd.get_dummies(df_meteroritos['fall'])

       Fell  Found
0         1      0
1         1      0
2         1      0
3         1      0
4         1      0
...     ...    ...
45711     0      1
45712     0      1
45713     0      1
45714     0      1
45715     0      1

[45716 rows x 2 columns]

In [44]:
df_meteroritos['ones']=1
df_meteroritos

             name     id nametype  ... reclong               GeoLocation ones
0          Aachen      1    Valid  ...     6.1     (50.775000, 6.083330)    1
1          Aarhus      2    Valid  ...    10.2    (56.183330, 10.233330)    1
2            Abee      6    Valid  ...  -113.0  (54.216670, -113.000000)    1
3        Acapulco     10    Valid  ...   -99.9   (16.883330, -99.900000)    1
4         Achiras    370    Valid  ...   -65.0  (-33.166670, -64.950000)    1
...           ...    ...      ...  ...     ...                       ...  ...
45711  Zillah 002  31356    Valid  ...    17.0    (29.037000, 17.018500)    1
45712      Zinder  30409    Valid  ...     9.0     (13.783330, 8.966670)    1
45713        Zlin  30410    Valid  ...    17.7    (49.250000, 17.666670)    1
45714   Zubkovsky  31357    Valid  ...    41.5    (49.789170, 41.504600)    1
45715  Zulu Queen  30414    Valid  ...  -115.7  (33.983330, -115.683330)    1

[45716 rows x 11 columns]

In [45]:
df_meteroritos[['Fell','Found']]=pd.get_dummies(df_meteroritos['fall'])
df_meteroritos

             name     id nametype  ... ones  Fell Found
0          Aachen      1    Valid  ...    1     1     0
1          Aarhus      2    Valid  ...    1     1     0
2            Abee      6    Valid  ...    1     1     0
3        Acapulco     10    Valid  ...    1     1     0
4         Achiras    370    Valid  ...    1     1     0
...           ...    ...      ...  ...  ...   ...   ...
45711  Zillah 002  31356    Valid  ...    1     0     1
45712      Zinder  30409    Valid  ...    1     0     1
45713        Zlin  30410    Valid  ...    1     0     1
45714   Zubkovsky  31357    Valid  ...    1     0     1
45715  Zulu Queen  30414    Valid  ...    1     0     1

[45716 rows x 13 columns]

In [52]:
#Fechas

df_meteroritos['year']

0        1880
1        1951
2        1952
3        1976
4        1902
         ...
45711    1990
45712    1999
45713    1939
45714    2003
45715    1976
Name: year, Length: 45716, dtype: object

In [53]:
pd.to_datetime(
    df_meteroritos['year'],
    errors = 'coerce',
    format ='%Y'
)

0       1880-01-01
1       1951-01-01
2       1952-01-01
3       1976-01-01
4       1902-01-01
           ...
45711   1990-01-01
45712   1999-01-01
45713   1939-01-01
45714   2003-01-01
45715   1976-01-01
Name: year, Length: 45716, dtype: datetime64[ns]

In [54]:
 df_meteroritos['year']=pd.to_datetime(
    df_meteroritos['year'],
    errors = 'coerce',
    format ='%Y'
)

In [63]:
df_meteroritos.convert_dtypes().dtypes

name                   string
id                      Int64
nametype               string
recclass               string
mass                  float64
fall                   string
year           datetime64[ns]
reclat                float64
reclong               float64
GeoLocation            string
dtype: object

In [65]:
df_meteroritos.rename(columns={'mass':'masa'},inplace=True)

In [66]:
df_meteroritos.convert_dtypes().dtypes

name                   string
id                      Int64
nametype               string
recclass               string
masa                  float64
fall                   string
year           datetime64[ns]
reclat                float64
reclong               float64
GeoLocation            string
dtype: object

In [67]:
list(df_meteroritos)

['name',
 'id',
 'nametype',
 'recclass',
 'masa',
 'fall',
 'year',
 'reclat',
 'reclong',
 'GeoLocation']